Table of Contents
 Enum CrossSectionConversionTable
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Conversion table of cross-section
public enum CrossSectionConversionTable
Fields
AdvanceDesign = 5
Conversion table of AdvanceDesign CSS will be used, it is useable for AdvanceDesign, ...
Autodesk = 2
Conversion table of Autodesk CSS will be used, it is useable for Robot, Revit, ...
NoUsed = 0
Conversion table will be not used
SAP2000 = 3
Conversion table of SAP2000 will be used, it is useable for SAP2000 ...
SCIA = 1
Conversion table of SCIA CSS will be used
StaadPro = 4
Conversion table of StaadPro CSS will be used, it is useable for StaadPro, ...
Fields
 Name |  Description
 AdvanceDesign = 5
Conversion table of AdvanceDesign CSS will be used, it is useable for AdvanceDesign, ...
 Autodesk = 2
Conversion table of Autodesk CSS will be used, it is useable for Robot, Revit, ...
 NoUsed = 0
Conversion table will be not used
 SAP2000 = 3
Conversion table of SAP2000 will be used, it is useable for SAP2000 ...
 SCIA = 1
Conversion table of SCIA CSS will be used
 StaadPro = 4
Conversion table of StaadPro CSS will be used, it is useable for StaadPro, ...
 Edit this page